while True:
    try:
        A = int(input("Введіть число (від 1 до 10000): "))
        if 1 <= A <= 10000:
            if A % 2 == 0:
                print(f"Квадрат вашого парного числа [{A}]: {A ** 2}")
                break
            else:
                print(f"Куб вашого непарного числа [{A}]: {A ** 3}")
                break
        else:
            print("Введено некоректне значення, спробуйте ще раз")
    except ValueError:
        print("Помилка - потрібно ввести лише ціле число")